Revit 2026 API

# ControlledApplicationVersionNumber Property

---
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string VersionNumber { get; }
```
```vb
Public ReadOnly Property VersionNumber As String
	Get
```
```cpp
public:
property String^ VersionNumber {
	String^ get ();
}
```
```fsharp
member VersionNumber : string with get
```

#### Property Value

String

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace